In [69]:
import pandas as pd
orders_df=pd.read_csv("orders.csv")
print(orders_df.head())

   order_id  user_id  restaurant_id  order_date  total_amount  \
0         1     2508            450  18-02-2023        842.97
1         2     2693            309  18-01-2023        546.68
2         3     2084            107  15-07-2023        163.93
3         4      319            224  04-10-2023       1155.97
4         5     1064            293  25-12-2023       1321.91

                  restaurant_name
0               New Foods Chinese
1  Ruchi Curry House Multicuisine
2           Spice Kitchen Punjabi
3          Darbar Kitchen Non-Veg
4       Royal Eatery South Indian

In [70]:
users_df=pd.read_json("users.json")
print(users_df.head())

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [71]:
orders_users_df=pd.merge(
    orders_df,
    users_df,
    on="user_id",
    how="left"
)

In [72]:
import sqlite3
import pandas as pd

conn=sqlite3.connect("restaurants.db")
conn.execute("Drop Table if exists restaurants;")

with open("restaurants.sql","r") as f:
    sql_script=f.read()

    conn.executescript(sql_script)

    restaurants_df=pd.read_sql("select* from restaurants",conn)
    restaurants_df.head()

In [73]:
final_df=pd.merge(
    orders_users_df,
    restaurants_df,
    on="restaurant_id",
    how="left"

)

In [74]:
final_df.to_csv("final_food_delivery_dataset.csv",index=False)
print("Final dataset created successfully!")

Final dataset created successfully!

In [75]:
final_df[final_df['membership']=='Gold']\
.groupby('city')['total_amount']\
.sum()\
.sort_values(ascending=False)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [76]:
final_df.groupby('cuisine')['total_amount']\
.mean()\
.sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [77]:
user_spend=final_df.groupby('user_id')['total_amount'].sum()
user_spend[user_spend > 1000].count()

np.int64(2544)

In [78]:
final_df['rating_range']=pd.cut(
    final_df['rating'],
    bins=[3.0,3.5,4.0,4.5,5.0],
    labels=['3.0-3.5','3.6-4.0','4.1-4.5','4.6-5.0']
)

final_df.groupby('rating_range')['total_amount']\
.sum()\
.sort_values(ascending=False)

/tmp/ipython-input-1090987885.py:7: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  final_df.groupby('rating_range')['total_amount']\

rating_range
4.6-5.0    2197030.75
4.1-4.5    1960326.26
3.0-3.5    1881754.57
3.6-4.0    1717494.41
Name: total_amount, dtype: float64

In [79]:
final_df[final_df['membership']=='Gold']\
.groupby('city')['total_amount']\
.mean()\
.sort_values(ascending=False)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [80]:
cuisine_stats=final_df.groupby('cuisine').agg(
    restaurants=('restaurant_name_y','nunique'),
    revenue=('total_amount','sum')
)
cuisine_stats.sort_values(['restaurants','revenue'],ascending=[True,False])

         restaurants     revenue
cuisine
Chinese          120  1930504.65
Italian          126  2024203.80
Indian           126  1971412.58
Mexican          128  2085503.09

In [81]:
gold_orders=final_df[final_df['membership']=='Gold']['order_id'].count()
total_orders=final_df['order_id'].count()
round((gold_orders/total_orders)*100)

50

In [83]:
restaurant_stats = final_df.groupby('restaurant_name_y').agg(
    avg_order=('total_amount', 'mean'),
    total_orders=('order_id', 'count')
)

restaurant_stats[restaurant_stats['total_orders'] < 20] \
    .sort_values('avg_order', ascending=False)

                     avg_order  total_orders
restaurant_name_y
Restaurant_294     1040.222308            13
Restaurant_262     1029.473333            18
Restaurant_77      1029.180833            12
Restaurant_193     1026.306667            15
Restaurant_7       1002.140625            16
...                        ...           ...
Restaurant_184      621.828947            19
Restaurant_498      596.815556            18
Restaurant_192      589.972857            14
Restaurant_329      578.578667            15
Restaurant_300      572.686471            17

[241 rows x 2 columns]

In [ ]:
final_df.groupby(['membership', 'cuisine'])['total_amount'] \
    .sum() \
    .sort_values(ascending=False)

In [ ]:
final_df['order_date'] = pd.to_datetime(final_df['order_date'])
final_df['quarter'] = final_df['order_date'].dt.to_period('Q')

final_df.groupby('quarter')['total_amount'] \
    .sum() \
    .sort_values(ascending=False)

In [ ]:
gold_orders = final_df[final_df['membership'] == 'Gold']['order_id'].count()
gold_orders

In [ ]:
hyderabad_revenue = final_df[final_df['city'] == 'Hyderabad']['total_amount'].sum()
round(hyderabad_revenue)

In [ ]:
distinct_users = final_df['user_id'].nunique()
distinct_users

In [ ]:
gold_avg_order = final_df[final_df['membership'] == 'Gold']['total_amount'].mean()
round(gold_avg_order, 2)

In [ ]:
high_rating_orders = final_df[final_df['rating'] >= 4.5]['order_id'].count()
high_rating_orders

In [ ]:
top_city = final_df[final_df['membership'] == 'Gold'] \
    .groupby('city')['total_amount'] \
    .sum() \
    .idxmax()

top_city

In [ ]:
orders_top_city = final_df[
    (final_df['membership'] == 'Gold') &
    (final_df['city'] == top_city)
]['order_id'].count()

orders_top_city

In [ ]:
final_df.columns